tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2023 Vekatech Ltd.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/mpconfig.h"
#include <string.h>
#include "py/runtime.h"
#include "py/mphal.h"
#include "modmachine.h"
#include "hal_data.h"
#if defined(USE_FSP_DRW)
#include "dave2d_port.h"
#endif
#if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
#include "lvgl/lvgl.h"
#endif
#if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
#include "ra_iq_adc.h"
#endif

#if MODULE_LCD_ENABLED

#define FT5X06_DOWN          0
#define FT5X06_UP            1
#define FT5X06_CONTACT       2
#define FT5X06_NUM_POINTS    5
#define FT5X06_REG_TD_STATUS 0x02
#define FT5X06_I2C_TIMEOUT_MS 5U

#define extract_e(t) ((uint8_t)((t).event))
#define extract_x(t) ((int16_t)(((t).x_msb << 8) | ((t).x_lsb)))
#define extract_y(t) ((int16_t)(((t).y_msb << 8) | ((t).y_lsb)))

typedef enum
{
    TOUCH_EVENT_NONE,
    TOUCH_EVENT_DOWN,
    TOUCH_EVENT_HOLD,
    TOUCH_EVENT_MOVE,
    TOUCH_EVENT_UP
} touch_event_t;

typedef struct st_touch_coord
{
    uint16_t x;
    uint16_t y;
    touch_event_t event;
} touch_coord_t;

typedef struct st_ft5x06_touch
{
    uint8_t x_msb : 4;
    uint8_t       : 2;
    uint8_t event : 2;
    uint8_t x_lsb;

    uint8_t y_msb : 4;
    uint8_t id    : 4;
    uint8_t y_lsb : 8;

    uint8_t res1;
    uint8_t res2;
} ft5x06_touch_t;

/* Complete FT5X06 data payload (number of active points + all five touch points) */

typedef struct st_touch_data
{
    uint8_t num_stamp_points;
    touch_coord_t stamp_point[FT5X06_NUM_POINTS];
} touch_data_t;

typedef struct st_ft5x06_payload
{
    uint8_t num_points_active;
    ft5x06_touch_t data_raw[FT5X06_NUM_POINTS];
} ft5x06_payload_t;

typedef struct _machine_lcd_obj_t {
    mp_obj_base_t base;
    uint8_t idx;                // currently used buffer;
    uint8_t isinited;
    uint8_t isstarted;
    uint8_t ischanged;
    mp_hal_pin_obj_t bl;  // backlight ctr (ON OFF)
    mp_hal_pin_obj_t en;  // enable ctr (ON OFF)
    mp_hal_pin_obj_t tch; // touch

    uint8_t num_points;
    touch_coord_t point[FT5X06_NUM_POINTS];
} machine_lcd_obj_t;

static volatile uint8_t I2C_complete = 0;
static volatile i2c_master_event_t s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
static volatile uint8_t s_touch_read_pending = 0;
static volatile uint8_t s_lcd_touch_active = 0;
static int16_t s_lcd_touch_x = 0;
static int16_t s_lcd_touch_y = 0;
static volatile uint32_t s_touch_irq_count = 0;
static volatile uint32_t s_touch_i2c_errors = 0;
static volatile uint32_t s_touch_i2c_timeouts = 0;

touch_data_t locked;

STATIC machine_lcd_obj_t machine_lcd_obj = {{&machine_lcd_type}, 0, 0, 0, 0, pin_P801, pin_P806, pin_P800, 0};

STATIC fsp_err_t lcd_glcdc_stop(void) {
    fsp_err_t err = FSP_SUCCESS;

    for (size_t retry = 0; retry < 50; retry++) {
        err = R_GLCDC_Stop(&g_display0_ctrl);
        if (err != FSP_ERR_INVALID_UPDATE_TIMING) {
            break;
        }
        mp_hal_delay_ms(1);
    }

    return err;
}

STATIC fsp_err_t lcd_glcdc_close(void) {
    fsp_err_t err = FSP_SUCCESS;

    for (size_t retry = 0; retry < 50; retry++) {
        err = R_GLCDC_Close(&g_display0_ctrl);
        if (err != FSP_ERR_INVALID_UPDATE_TIMING) {
            break;
        }
        mp_hal_delay_ms(1);
    }

    return err;
}

void machine_lcd_soft_reset(void) {
    machine_lcd_obj_t *self = &machine_lcd_obj;

    if (!self->isinited) {
        return;
    }

    R_ICU_ExternalIrqDisable(&g_external_irq11_ctrl);
    R_ICU_ExternalIrqClose(&g_external_irq11_ctrl);
    R_SCI_I2C_Close(&g_i2c_touch_ctrl);

    if (self->isstarted && FSP_SUCCESS == lcd_glcdc_stop()) {
        self->isstarted = 0;
    }

    if (FSP_SUCCESS == lcd_glcdc_close()) {
        self->isinited = 0;
        self->isstarted = 0;
    }

    ra_gpio_write(self->bl->pin, 0);
    ra_gpio_write(self->en->pin, 0);
    ra_gpio_write(self->tch->pin, 0);
    self->num_points = 0;
    I2C_complete = 0;
    s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
    s_touch_read_pending = 0;
    s_lcd_touch_active = 0;
    memset(&locked, 0, sizeof(locked));
}

static uint8_t s_lcd_lvgl_bridged = 0;   // C LVGL display/indev bridge installed?

#if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
#define LCD_SPECTRUM_BARS       (27U)
#define LCD_SPECTRUM_GAP_PX     (4)
#define LCD_SPECTRUM_MAX_H_PX   (50)
#define LCD_SPECTRUM_PHASES     (5U)
#define LCD_SPECTRUM_TICK_MS    (10U)
#define LCD_SPECTRUM_PHASE_MS   (20U)
#define LCD_SPECTRUM_FRAME_MS   (100U)
#define LCD_WATERFALL_FRAME_MS  (33U)
#define LCD_SCOPE_FRAME_MS      (33U)
#define LCD_WATERFALL_PIXELS    (256U)
#define LCD_SCOPE_PIXELS        (128U)
#define LCD_NATIVE_GAP_PX       (4)
#define LCD_WATERFALL_TOP_PAD   (18)
#define LCD_WATERFALL_SPEC_H    (30)
#define LCD_WATERFALL_GAP_PX    (2)
#define LCD_VIEW_SPECTRUM       (0U)
#define LCD_VIEW_WATERFALL      (1U)
static lv_obj_t *s_lcd_spectrum_obj;
static int16_t s_lcd_spectrum_h[LCD_SPECTRUM_BARS];
static int16_t s_lcd_spectrum_target[LCD_SPECTRUM_BARS];
static lv_timer_t *s_lcd_spectrum_timer;
static lv_color_t s_lcd_spectrum_bg;
static lv_color_t s_lcd_spectrum_bar;
static lv_color_t s_lcd_spectrum_center;
static uint8_t s_lcd_spectrum_valid;
static uint8_t s_lcd_spectrum_target_valid;
static uint8_t s_lcd_spectrum_phase;
static uint8_t s_lcd_spectrum_view;
static uint8_t s_lcd_spectrum_paused;
static uint8_t s_lcd_waterfall_reset;
static uint32_t s_lcd_spectrum_last_fft_ms;
static uint32_t s_lcd_spectrum_last_phase_ms;
static uint32_t s_lcd_waterfall_rows;
static uint32_t s_lcd_waterfall_last_us;
static uint32_t s_lcd_waterfall_max_us;
static uint32_t s_lcd_fft_last_us;
static uint32_t s_lcd_fft_max_us;
static int32_t s_lcd_scope_peak;
static uint32_t s_lcd_scope_last_ms;
static uint32_t s_lcd_render_start_us;
static uint32_t s_lcd_render_last_us;
static uint32_t s_lcd_render_max_us;
static uint32_t s_lcd_render_start_frame;
static uint32_t s_lcd_render_crossed_frames;
#endif

