tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
void machine_lcd_lvgl_soft_reset(void) {
    #if defined(MICROPY_PY_LVGL) && (MICROPY_PY_LVGL == 1)
    if (lv_is_initialized()) {
        s_lcd_lvgl_bridged = 0;          // lv_deinit destroys the C display/indev
        #if defined(USE_FSP_DRW)
        vk_ra6m3_dave2d_prepare_deinit();
        #endif
        lv_deinit();
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_timer = NULL;
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_target_valid = 0U;
        s_lcd_spectrum_view = LCD_VIEW_SPECTRUM;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_spectrum_last_phase_ms = 0U;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        s_lcd_scope_peak = 32;
        s_lcd_scope_last_ms = 0U;
        #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
        ra_iq_adc_spectrum_enable(0U);
        #endif
        s_lcd_render_start_us = 0U;
        s_lcd_render_last_us = 0U;
        s_lcd_render_max_us = 0U;
        s_lcd_render_start_frame = 0U;
        s_lcd_render_crossed_frames = 0U;
        #if defined(USE_FSP_DRW)
        vk_ra6m3_dave2d_finish_deinit();
        #endif
    }
    #endif
}

void touch_i2c_callback(i2c_master_callback_args_t *p_args) {
    s_touch_i2c_event = p_args->event;
    I2C_complete = 1;
}

static bool touch_i2c_wait(i2c_master_event_t expected_event) {
    uint32_t start_ms = (uint32_t)mp_hal_ticks_ms();
    while (!I2C_complete) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - start_ms) >= FT5X06_I2C_TIMEOUT_MS) {
            s_touch_i2c_timeouts++;
            (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
            return false;
        }
    }

    if (s_touch_i2c_event != expected_event) {
        s_touch_i2c_errors++;
        return false;
    }
    return true;
}

static bool ft5x06_payload_get(void) {
    machine_lcd_obj_t *self = &machine_lcd_obj;
    touch_coord_t new_touch;
    ft5x06_payload_t touch_payload;

    /* Clear payload struct */
    memset(&touch_payload, 0, sizeof(ft5x06_payload_t));

    /* Read the data about the touch point(s) */
    uint8_t reg = FT5X06_REG_TD_STATUS;

    /* Write TD_STATUS address */
    I2C_complete = 0;
    s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (FSP_SUCCESS != R_SCI_I2C_Write(&g_i2c_touch_ctrl, &reg, 1, true)) {
        s_touch_i2c_errors++;
        (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
        return false;
    }
    if (!touch_i2c_wait(I2C_MASTER_EVENT_TX_COMPLETE)) {
        return false;
    }

    /* Read TD_STATUS through all five TOUCHn_** register sets */
    I2C_complete = 0;
    s_touch_i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (FSP_SUCCESS != R_SCI_I2C_Read(&g_i2c_touch_ctrl, (uint8_t *)&touch_payload,
        sizeof(ft5x06_payload_t), false)) {
        s_touch_i2c_errors++;
        (void)R_SCI_I2C_Abort(&g_i2c_touch_ctrl);
        return false;
    }
    if (!touch_i2c_wait(I2C_MASTER_EVENT_RX_COMPLETE)) {
        return false;
    }

    uint8_t num_points = touch_payload.num_points_active & 0x0fU;
    if (num_points > FT5X06_NUM_POINTS) {
        num_points = FT5X06_NUM_POINTS;
    }
    bool any_active = false;
    int16_t release_x = s_lcd_touch_x;
    int16_t release_y = s_lcd_touch_y;

    if (num_points) {
        /* Process the raw data for the touch point(s) into useful data */
        for (uint8_t i = 0; i < num_points; i++)
        {
            new_touch.x = (uint16_t)extract_x(touch_payload.data_raw[i]);
            new_touch.y = (uint16_t)extract_y(touch_payload.data_raw[i]);
            new_touch.event = extract_e(touch_payload.data_raw[i]);
            bool point_active = false;

            /* Set event type based on received data */
            switch (new_touch.event)
            {
                case FT5X06_DOWN:
                    self->point[i].event = TOUCH_EVENT_DOWN;
                    point_active = true;
                    break;
                case FT5X06_UP:
                    self->point[i].event = TOUCH_EVENT_UP;
                    break;
                case FT5X06_CONTACT:
                    /* Check if the point is moving or not */
                    if ((self->point[i].x != new_touch.x) || (self->point[i].y != new_touch.y)) {
                        self->point[i].event = TOUCH_EVENT_MOVE;
                    } else {
                        self->point[i].event = TOUCH_EVENT_HOLD;
                    }
                    point_active = true;
                    break;
                default:
                    self->point[i].event = TOUCH_EVENT_NONE;
                    break;
            }

            /* Set new coordinates */
            self->point[i].x = new_touch.x;
            self->point[i].y = new_touch.y;
            release_x = (int16_t)new_touch.x;
            release_y = (int16_t)new_touch.y;
            if (point_active) {
                any_active = true;
                s_lcd_touch_x = (int16_t)new_touch.x;
                s_lcd_touch_y = (int16_t)new_touch.y;
            }
        }
    }

    /* Preserve the last release position, and publish every packet (including UP/zero). */
    if (!any_active && num_points) {
        s_lcd_touch_x = release_x;
        s_lcd_touch_y = release_y;
    }
    self->num_points = num_points;
    s_lcd_touch_active = any_active ? 1U : 0U;
    return true;
}

static bool touch_service_pending(void) {
    bool pending;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    pending = s_touch_read_pending != 0U;
    s_touch_read_pending = 0;
    FSP_CRITICAL_SECTION_EXIT;

    if (!pending) {
        return true;
    }
    if (!ft5x06_payload_get()) {
        machine_lcd_obj.num_points = 0;
        s_lcd_touch_active = 0;
        return false;
    }
    return true;
}

void callback_icu(external_irq_callback_args_t *p_args) { // callback_icu
    if (g_external_irq11_cfg.channel == p_args->channel) {
        /* Never transact on SCI-I2C in the external IRQ. The next LVGL/Python poll
         * consumes this flag and performs one bounded foreground transaction. */
        s_touch_irq_count++;
        s_touch_read_pending = 1;
    }
}

static volatile uint32_t lcd_vsync_counter = 0;

