tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
/*
STATIC mp_obj_t lcd_changebuf(mp_obj_t self_in, mp_obj_t idx){
	machine_lcd_obj_t *self = MP_OBJ_TO_PTR(self_in);
	mp_int_t i = mp_obj_get_int(idx);

	self->ischanged = 0;
	if(self->isinited && self->isstarted)
		if(FSP_SUCCESS == R_GLCDC_BufferChange(&g_display0_ctrl, fb_background[i? 1 : 0], DISPLAY_FRAME_LAYER_1))
		{
			self->ischanged = 1;
			self->idx = i;
		}
	return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_changebuf_obj, lcd_changebuf);
*/
// vsync([timeout_ms=20]) -- block until the NEXT GLCDC line-detect (VSYNC)
// event or timeout. Returns True if the pulse arrived, False on timeout.
// Used to gate LVGL render start so DIRECT-mode drawing chases the scanout
// beam instead of racing it mid-frame (visible flicker on frequent updates).
STATIC mp_obj_t lcd_vsync(size_t n_args, const mp_obj_t *args) {
    (void)args;
    uint32_t timeout_ms = (n_args > 1) ? (uint32_t)mp_obj_get_int(args[1]) : 20;
    uint32_t start_cnt = lcd_vsync_counter;
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= timeout_ms) {
            return mp_const_false;
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_vsync_obj, 1, 2, lcd_vsync);

/* ---- C LVGL display + input bridge -----------------------------------------------
 * Replaces the per-frame Python flush/touch/VSYNC callbacks in pRGB.py.  Those allocate
 * MicroPython wrapper objects on every render (flush) and every ~30 Hz input poll (read)
 * -- a continuous idle garbage stream that forces GC.  Registering the same three
 * callbacks in C removes that garbage entirely.  DIRECT single-framebuffer, identical
 * behaviour to the Python path (GLCDC framebuffer, cached FT5x06 touch, VSYNC gate). */
static void lcd_lv_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    (void)area;
    (void)px_map;
    lv_display_flush_ready(disp);                    // DIRECT mode: drawing is done
}

static volatile uint32_t s_indev_calls = 0;          // diag: LVGL polls of the read cb
static volatile uint32_t s_indev_press = 0;          // diag: reads that saw a contact

static void lcd_lv_indev_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
    (void)indev;
    s_indev_calls++;
    /* The external IRQ only raises a flag. Service at most one bounded SCI-I2C read here,
     * in foreground context, then report the persistent DOWN/MOVE/HOLD versus UP level.
     * No fresh FT5x06 packet means "state unchanged", not a synthetic RELEASED. */
    (void)touch_service_pending();

    uint8_t active;
    int16_t x;
    int16_t y;
    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;
    active = s_lcd_touch_active;
    x = s_lcd_touch_x;
    y = s_lcd_touch_y;
    FSP_CRITICAL_SECTION_EXIT;
    if (active) {
        s_indev_press++;
    }
    data->point.x = (int32_t)x;
    data->point.y = (int32_t)y;
    data->state = active ? LV_INDEV_STATE_PRESSED : LV_INDEV_STATE_RELEASED;
}

// touch_debug() -> (indev polls, pressed polls, x, y, active, IRQs, I2C errors, timeouts).
STATIC mp_obj_t lcd_touch_debug(mp_obj_t self_in) {
    (void)self_in;
    mp_obj_t t[8] = {
        mp_obj_new_int_from_uint(s_indev_calls),
        mp_obj_new_int_from_uint(s_indev_press),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_x),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_y),
        MP_OBJ_NEW_SMALL_INT(s_lcd_touch_active),
        mp_obj_new_int_from_uint(s_touch_irq_count),
        mp_obj_new_int_from_uint(s_touch_i2c_errors),
        mp_obj_new_int_from_uint(s_touch_i2c_timeouts),
    };
    return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_touch_debug_obj, lcd_touch_debug);

static void lcd_lv_render_start_cb(lv_event_t *e) {
    (void)e;
    uint32_t start_cnt = lcd_vsync_counter;          // wait for the next GLCDC frame pulse
    uint32_t t0 = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == start_cnt) {
        if ((uint32_t)mp_hal_ticks_ms() - t0 >= 20U) {
            break;
        }
    }
    s_lcd_render_start_frame = lcd_vsync_counter;
    s_lcd_render_start_us = (uint32_t)mp_hal_ticks_us();
}

static void lcd_lv_render_ready_cb(lv_event_t *e) {
    (void)e;
    if (s_lcd_render_start_us == 0U) {
        return;
    }
    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - s_lcd_render_start_us;
    s_lcd_render_last_us = elapsed;
    if (elapsed > s_lcd_render_max_us) {
        s_lcd_render_max_us = elapsed;
    }
    if (lcd_vsync_counter != s_lcd_render_start_frame) {
        s_lcd_render_crossed_frames++;
    }
}

/* ---- C spectrum surface ----------------------------------------------------------
 * A high-rate graph must not be represented by 27 independently laid-out Python
 * widgets.  This attaches one ordinary LVGL object to a native draw callback, stores
 * the 27 heights in fixed C memory, and invalidates only the changed bar strips.
 * There is no Python draw callback, flex re-layout, transient canvas, or heap traffic. */
static void lcd_lv_spectrum_plot_area(const lv_area_t *obj_area,
    lv_area_t *plot_area) {
    *plot_area = *obj_area;
    plot_area->x1 = obj_area->x1;
    plot_area->x2 = plot_area->x1 + (int32_t)LCD_WATERFALL_PIXELS - 1;
    plot_area->y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
}

static void lcd_lv_spectrum_bar_area(const lv_area_t *obj_area, uint32_t index,
    int32_t height, lv_area_t *bar_area) {
    int32_t width = lv_area_get_width(obj_area);
    int32_t gaps = (int32_t)(LCD_SPECTRUM_BARS - 1U) * LCD_SPECTRUM_GAP_PX;
    int32_t usable = width - gaps;
    int32_t base_w = usable / (int32_t)LCD_SPECTRUM_BARS;
    int32_t extra = usable % (int32_t)LCD_SPECTRUM_BARS;
    int32_t x = obj_area->x1 + (int32_t)index * (base_w + LCD_SPECTRUM_GAP_PX) +
        (((int32_t)index < extra) ? (int32_t)index : extra);
    int32_t bar_w = base_w + (((int32_t)index < extra) ? 1 : 0);
    if (height < 2) {
        height = 2;
    } else if (height > LCD_SPECTRUM_MAX_H_PX) {
        height = LCD_SPECTRUM_MAX_H_PX;
    }
    bar_area->x1 = x;
    bar_area->x2 = x + bar_w - 1;
    bar_area->y2 = obj_area->y2;
    bar_area->y1 = obj_area->y2 - height + 1;
}

/* Fast approximate -60..0 dB mapping without 256 log10f calls per row.  IEEE-754
 * exponent + the top mantissa byte approximate log2(r); 10 octaves are 60.2 dB. */
static uint8_t lcd_waterfall_level(float ratio) {
    if (!(ratio > 0.0009765625f)) {       /* <= 2^-10 */
        return 0U;
    }
    if (ratio >= 1.0f) {
        return 255U;
    }
    union {
        float f;
        uint32_t u;
    } bits = { .f = ratio };
    int32_t exponent = (int32_t)((bits.u >> 23) & 0xFFU) - 127;
    int32_t log2_q8 = exponent * 256 + (int32_t)((bits.u >> 15) & 0xFFU);
    int32_t level = ((log2_q8 + 10 * 256) * 255) / (10 * 256);
    if (level < 0) {
        level = 0;
    } else if (level > 255) {
        level = 255;
    }
    return (uint8_t)level;
}

/* PicoRX-style six-section heat map, calculated directly into RGB565.  Keeping the
 * conversion arithmetic here avoids a second 256-entry image/palette buffer. */
static uint16_t lcd_waterfall_rgb565(uint8_t level) {
    uint32_t scaled = (uint32_t)level * 6U;
    uint8_t section = (uint8_t)(scaled >> 8);
    uint8_t t = (uint8_t)scaled;
    uint8_t r = 0U;
    uint8_t g = 0U;
    uint8_t b = 0U;
    switch (section) {
        case 0: b = t; break;                         /* black -> blue   */
        case 1: g = t; b = 255U; break;              /* blue -> cyan    */
        case 2: g = 255U; b = (uint8_t)(255U - t); break; /* cyan -> green */
        case 3: r = t; g = 255U; break;              /* green -> yellow */
        case 4: r = 255U; g = (uint8_t)(255U - t); break; /* yellow -> red */
        default: r = 255U; g = t; b = t; break;      /* red -> white    */
    }
    return lv_color_to_u16(lv_color_make(r, g, b));
}

/* The WF view is combined, not waterfall-only.  Reduce the current FFT to the
 * 256 physical X pixels with peak-per-bin-group.  The live spectrum and new
 * waterfall row are produced in the same loop, so they always use the identical
 * frequency mapping and no intermediate display buffer is needed. */
static void lcd_waterfall_draw_frame(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, uint16_t *new_row, const float *magnitudes,
    uint32_t fft_n, float inv, int32_t shift_bins) {
    lv_area_t plot = {
        .x1 = obj_area->x1,
        .y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD,
        .y2 = obj_area->y1 + LCD_WATERFALL_TOP_PAD + LCD_WATERFALL_SPEC_H - 1,
    };
    plot.x2 = plot.x1 + (int32_t)LCD_WATERFALL_PIXELS - 1;

    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    for (int32_t y = plot.y1; y <= plot.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)plot.x1;
        for (int32_t x = plot.x1; x <= plot.x2; ++x) {
            row[x - plot.x1] = bg;
        }
    }

    uint16_t bar_color = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t center_color = lv_color_to_u16(s_lcd_spectrum_center);
    for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
        uint32_t lo = (x * fft_n) / LCD_WATERFALL_PIXELS;
        uint32_t hi = ((x + 1U) * fft_n) / LCD_WATERFALL_PIXELS;
        float peak = 0.0f;
        for (uint32_t k = lo; k < hi; ++k) {
            uint32_t src = (uint32_t)((int32_t)k + (int32_t)(fft_n / 2U) +
                shift_bins) & (fft_n - 1U);
            if (magnitudes[src] > peak) {
                peak = magnitudes[src];
            }
        }
        uint8_t level = lcd_waterfall_level(peak * inv);
        new_row[x] = lcd_waterfall_rgb565(level);
        int32_t height = 1 + ((int32_t)level *
            (LCD_WATERFALL_SPEC_H - 1) + 127) / 255;
        int32_t px = plot.x1 + (int32_t)x;
        uint16_t color = (x == (LCD_WATERFALL_PIXELS / 2U)) ?
            center_color : bar_color;
        for (int32_t y = plot.y2 - height + 1; y <= plot.y2; ++y) {
            fb[(uint32_t)y * stride + (uint32_t)px] = color;
        }
    }
}

