tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    int32_t previous_y = scope_y[0];
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        int32_t y = scope_y[x];
        int32_t lo = (y < previous_y) ? y : previous_y;
        int32_t hi = (y > previous_y) ? y : previous_y;
        int32_t px = x1 + (int32_t)x;
        for (int32_t py = lo; py <= hi; ++py) {
            fb[(uint32_t)py * stride + (uint32_t)px] = trace;
        }
        previous_y = y;
    }
}

/* Draw the 27 smoothed/phased SPEC bars into the far-left 256 pixels.  The timer
 * still changes only one of five interleaved bar groups every 20 ms, but the
 * current stable state is committed together with the right-hand scope after one
 * VSYNC.  This removes the competing periodic LVGL invalidations. */
static void lcd_spectrum_draw_direct(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area) {
    lv_area_t plot_area;
    lcd_lv_spectrum_plot_area(obj_area, &plot_area);
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t bar = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t center = lv_color_to_u16(s_lcd_spectrum_center);

    for (int32_t y = plot_area.y1; y <= plot_area.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)plot_area.x1;
        for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    for (uint32_t i = 0U; i < LCD_SPECTRUM_BARS; ++i) {
        lv_area_t area;
        lcd_lv_spectrum_bar_area(&plot_area, i, s_lcd_spectrum_h[i], &area);
        uint16_t color = (i == (LCD_SPECTRUM_BARS / 2U)) ? center : bar;
        for (int32_t y = area.y1; y <= area.y2; ++y) {
            uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)area.x1;
            for (int32_t x = area.x1; x <= area.x2; ++x) {
                row[x - area.x1] = color;
            }
        }
    }
}

/* Scope framebuffer transaction.  SPEC redraws its left panel in the same VSYNC
 * transaction.  A WF tick can reach this helper when the DAC frame is ready but
 * the FFT frame is not; in that case the left framebuffer is the waterfall
 * history and must not be touched. */
static void lcd_scope_write(const int16_t *samples, size_t n) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    int32_t native_w = (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX +
        (int32_t)LCD_SCOPE_PIXELS;
    if (lv_area_get_width(&obj_area) < native_w) {
        return;
    }
    int16_t scope_y[LCD_SCOPE_PIXELS];
    if (!lcd_scope_prepare(samples, n, &obj_area, scope_y)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= 20U) {
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    if (s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    }
    lcd_scope_draw(fb, stride, &obj_area, scope_y);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

/* Spectrum visual cadence remains the proven 10 Hz producer + five interleaved
 * 20 ms groups.  The DAC scope remains live at the right in both modes; WF draws
 * both panels in one direct transaction, while SPEC commits its phased bar state
 * and the scope together in another single direct transaction. */
static void lcd_lv_spectrum_timer_cb(lv_timer_t *timer) {
    (void)timer;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return;
    }
    /* Direct framebuffer pixels are legal only on the HOME receiver screen and
     * while no same-screen modal overlay is open.  lv_obj_is_visible() alone is
     * insufficient: objects on an inactive LVGL screen still have no HIDDEN flag. */
    if (s_lcd_spectrum_paused ||
        (lv_obj_get_screen(s_lcd_spectrum_obj) != lv_screen_active())) {
        return;
    }

    uint32_t now = (uint32_t)mp_hal_ticks_ms();
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    if (s_lcd_spectrum_view == LCD_VIEW_WATERFALL) {
        if ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_WATERFALL_FRAME_MS) {
            /* Advance the deadline, not "last = now".  The measured panel is 50 Hz;
             * retaining the 33 ms phase yields a 20/40/40 ms VSYNC pattern and a
             * true 30 rows/s average instead of rounding every update down to 25 Hz. */
            if ((s_lcd_spectrum_last_fft_ms == 0U) ||
                ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
                 (3U * LCD_WATERFALL_FRAME_MS))) {
                s_lcd_spectrum_last_fft_ms = now;
            } else {
                s_lcd_spectrum_last_fft_ms += LCD_WATERFALL_FRAME_MS;
            }
            const float *magnitudes;
            float ref_peak;
            int32_t shift_bins;
            const int16_t *scope_samples = NULL;
            size_t scope_n = 0U;
            bool scope_ready = ra_iq_adc_scope_frame(&scope_samples, &scope_n);
            uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
            bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &shift_bins);
            uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
            if (ready) {
                s_lcd_fft_last_us = fft_elapsed;
                if (fft_elapsed > s_lcd_fft_max_us) {
                    s_lcd_fft_max_us = fft_elapsed;
                }
                lcd_waterfall_write(magnitudes, ref_peak, shift_bins,
                    scope_ready ? scope_samples : NULL, scope_n);
            } else if (scope_ready) {
                lcd_scope_write(scope_samples, scope_n);
            }
        }
        return;
    }

