tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
// spectrum_update(array('h', 27)) -> number of changed targets, or False if detached.
// This only publishes the newest FFT targets.  The 20 ms C timer commits five
// interleaved groups on separate physical frames and queues narrow per-bar dirty
// strips; the native draw callback then paints through the normal VSYNC-gated path.
STATIC mp_obj_t lcd_spectrum_update(mp_obj_t self_in, mp_obj_t buf_in) {
    (void)self_in;
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        s_lcd_spectrum_valid = 0U;
        s_lcd_spectrum_target_valid = 0U;
        return mp_const_false;
    }
    if (s_lcd_spectrum_view != LCD_VIEW_SPECTRUM) {
        return MP_OBJ_NEW_SMALL_INT(0);
    }

    mp_buffer_info_t bi;
    mp_get_buffer_raise(buf_in, &bi, MP_BUFFER_READ);
    if ((bi.typecode != 'h') || (bi.len < LCD_SPECTRUM_BARS * sizeof(int16_t))) {
        mp_raise_ValueError(MP_ERROR_TEXT("buf must be array('h', >=27)"));
    }
    const int16_t *src = (const int16_t *)bi.buf;

    uint32_t changed = 0U;
    for (uint32_t i = 0U; i < LCD_SPECTRUM_BARS; ++i) {
        int16_t h = src[i];
        if (h < 2) {
            h = 2;
        } else if (h > LCD_SPECTRUM_MAX_H_PX) {
            h = LCD_SPECTRUM_MAX_H_PX;
        }
        if (!s_lcd_spectrum_target_valid || (h != s_lcd_spectrum_target[i])) {
            s_lcd_spectrum_target[i] = h;
            changed++;
        }
    }
    s_lcd_spectrum_target_valid = 1U;
    return MP_OBJ_NEW_SMALL_INT((mp_int_t)changed);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_spectrum_update_obj, lcd_spectrum_update);

// spectrum([view]) -- left view 0 = bars, 1 = waterfall; DAC scope stays at right.
// With no argument return:
// (view, direct_rows, last_write_us, max_write_us, last_fft_us, max_fft_us).
STATIC mp_obj_t lcd_spectrum(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        mp_obj_t t[6] = {
            MP_OBJ_NEW_SMALL_INT(s_lcd_spectrum_view),
            mp_obj_new_int_from_uint(s_lcd_waterfall_rows),
            mp_obj_new_int_from_uint(s_lcd_waterfall_last_us),
            mp_obj_new_int_from_uint(s_lcd_waterfall_max_us),
            mp_obj_new_int_from_uint(s_lcd_fft_last_us),
            mp_obj_new_int_from_uint(s_lcd_fft_max_us),
        };
        return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    }

    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_VIEW_SPECTRUM) &&
        (view != (mp_int_t)LCD_VIEW_WATERFALL)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0 or 1"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_spectrum_view) {
        s_lcd_spectrum_view = (uint8_t)view;
        s_lcd_spectrum_valid = 0U;
        s_lcd_waterfall_reset = 1U;
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_spectrum_last_phase_ms = 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_scope_peak = 32;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        lv_obj_invalidate(s_lcd_spectrum_obj);
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_obj, 1, 2,
    lcd_spectrum);

// spectrum_pause([pause]) -- stop direct framebuffer writes while a same-screen
// modal overlay covers the receiver.  Inactive full screens are rejected by the
// C timer independently, so this flag is only needed for overlays on HOME itself.
STATIC mp_obj_t lcd_spectrum_pause(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return mp_obj_new_bool(s_lcd_spectrum_paused != 0U);
    }

    uint8_t paused = mp_obj_is_true(args[1]) ? 1U : 0U;
    if (paused != s_lcd_spectrum_paused) {
        s_lcd_spectrum_paused = paused;
        if (!paused && (s_lcd_spectrum_obj != NULL) &&
            lv_obj_is_valid(s_lcd_spectrum_obj)) {
            /* The overlay/full-screen redraw owns these framebuffer pixels while
             * paused.  Rebuild the whole native surface on the first HOME frame. */
            s_lcd_waterfall_reset = 1U;
            s_lcd_spectrum_last_fft_ms = 0U;
            s_lcd_spectrum_last_phase_ms = 0U;
            s_lcd_scope_last_ms = 0U;
            lv_obj_invalidate(s_lcd_spectrum_obj);
        }
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_pause_obj, 1, 2,
    lcd_spectrum_pause);

// render_debug([reset]) -> (last_us, max_us, frame_crossings, line_pulses)
// frame_crossings must stay zero: a non-zero value means a render ran into the next
// GLCDC line-detect pulse while the controller was scanning the same framebuffer.
STATIC mp_obj_t lcd_render_debug(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    mp_obj_t t[4] = {
        mp_obj_new_int_from_uint(s_lcd_render_last_us),
        mp_obj_new_int_from_uint(s_lcd_render_max_us),
        mp_obj_new_int_from_uint(s_lcd_render_crossed_frames),
        mp_obj_new_int_from_uint(lcd_vsync_counter),
    };
    mp_obj_t result = mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    if ((n_args > 1U) && mp_obj_is_true(args[1])) {
        s_lcd_render_last_us = 0U;
        s_lcd_render_max_us = 0U;
        s_lcd_render_crossed_frames = 0U;
    }
    return result;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_render_debug_obj, 1, 2,
    lcd_render_debug);

// lvgl_setup() -- create the LVGL display + pointer indev in C with C callbacks, so no
// Python wrapper is allocated per frame or per input poll. Call once after lv.init().
// Returns True if the C bridge was installed (idempotent). pRGB uses it when present and
// keeps its Python callbacks only as a fallback for firmware without this method.
STATIC mp_obj_t lcd_lvgl_setup(mp_obj_t self_in) {
    (void)self_in;
    if (s_lcd_lvgl_bridged) {
        return mp_const_true;
    }
    if (!lv_is_initialized()) {
        lv_init();
    }
    uint32_t w = g_display0_cfg.input[0].hsize;
    uint32_t h = g_display0_cfg.input[0].vsize;
    void *fb = g_display0_cfg.input[0].p_base;
    uint32_t sz = g_display0_cfg.input[0].hstride * g_display0_cfg.input[0].vsize *
        ((g_display0_cfg.input[0].format < DISPLAY_IN_FORMAT_16BITS_RGB565) ? 4U : 2U);

    lv_display_t *disp = lv_display_create(w, h);
    if (disp == NULL) {
        return mp_const_false;
    }
    lv_display_set_color_format(disp, LV_COLOR_FORMAT_RGB565);
    lv_display_set_flush_cb(disp, lcd_lv_flush_cb);
    lv_display_set_buffers(disp, fb, NULL, sz, LV_DISPLAY_RENDER_MODE_DIRECT);
    lv_display_add_event_cb(disp, lcd_lv_render_start_cb, LV_EVENT_RENDER_START, NULL);
    lv_display_add_event_cb(disp, lcd_lv_render_ready_cb, LV_EVENT_RENDER_READY, NULL);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_display(indev, disp);
    lv_indev_set_read_cb(indev, lcd_lv_indev_read_cb);

